app/controllers/posts_controller.rb

	def edit
		@post = Post.find(params[:id])
		@post.update(title: params[:title], description: params[:description])
---
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2018-01-23 21:51:29.694751"], ["id", 1]]